//---------------------Kusto Query for lumma IOC  -------------------
//List all devices that accessed specific URLs or IPs associated with the malware
let iocs_ip = dynamic(["107.172.0.180", "116.203.10.69", "116.203.5.69", "147.45.44.131", "185.172.128.20", "185.172.128.8", "185.196.10.57", "194.49.94.97", "195.20.16.153", "217.12.206.230", "31.41.244.11", "77.105.132.27", "77.105.161.194", "78.46.239.218", "82.118.23.50", "91.90.195.152", "91.92.253.220"]);
let ioc_domains = dynamic(["a0895203.xsph.ru", "acrhitechinfo.com", "annoyingfiler.com", "apocalypsedoer.com", "bitbucket.org", "buck1st.oss-ap-southeast-5.aliyuncs.com", "bufetesanchezabogados.com", "cdn.discordapp.com", "codjikodsa.b-cdn.net", "comediantes.org", "d1.exploredairyaptitude.shop", "deduhko2.klipzyroloo.shop", "documents.notificationsapps.com", "download.all-instructions.com", "download.cdn-", "download.instructionclub.com", "download.wsconnect.org", "download1320.mediafire.com", "drive.google.com", "dropbox.com", "dropbox.database-files.com", "electrum-bch.net", "electrum-doge.org", "electrum-xrp.net", "ethscanold.com", "eu2.contabostorage.com", "extrasofts.org", "facturation-paiement.com", "files-opensocial.googleusercontent.com", "finalstepgo.com", "ftp.timeless-tales.shop", "github.com", "goldenstateglobalmail.com", "heavens.holistic-haven.shop", "iplogger.ru", "jokingnations.com", "joxi.net", "khel999.com", "lookingthroughtheturn.com", "mediafire.com", "mega.nz", "nhyslkpsklnf.b-cdn.net", "pastebin.pl", "pcworldgetin.net", "pleasegetthisfile.com", "pub-1f3e5ec684c24b40ae9d9716dd6514f0.r2.dev", "pub.foodie-safari.shop", "rainstorm.cyou", "rartxt41.b-cdn.net", "replica-souls.com", "resourceedge.org", "roundcube.custommarinesvcs.com", "safe-car.ru", "select-holidays.com", "solve.fizq.net", "solve.jrqr.org", "solve.porw.org", "solve.vwglq.com", "solve.xfzz.org", "t1.awagama.org", "t3.awagama.org", "tamanzakat.org", "tintin.klipdesak.shop", "transfernow.net", "uc2dde06dfda4495703517a59e75.dl.dropboxusercontent.com", "uc91daf4310fee1cc960d1e0f54d.dl.dropboxusercontent.com", "uc9747ff3be58ea20ff6ca331399.dl.dropboxusercontent.com", "versyasist.guru", "versyasist.space", "versyasist.website", "vk.com", "wintr41.b-cdn.net"]);
DeviceNetworkEvents
| where RemoteUrl has_any (ioc_domains) or RemoteIP has_any (iocs_ip)
| project-reorder Timestamp, DeviceName, ActionType, RemoteIP, RemoteUrl, InitiatingProcessFileName, InitiatingProcessCommandLine
